BACKEND/API_CI4/app/Controllers/Register.php

    public function index()
    {
        $rules = [
            'email' => ['rules' => 'required|min_length[4]|max_length[255]|valid_email|is_unique[users.email]'],
            'password' => ['rules' => 'required|min_length[8]|max_length[255]'],
            'confirm_password'  => [ 'label' => 'confirm password', 'rules' => 'matches[password]']
        ];


        if($this->validate($rules)){
            $model = new UserModel();
            $data = [
                'email'    => $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $model->save($data);
---
INSERT INTO `users` (`email`, `password`) VALUES ('syaifulramadhan714@gmail.com', '$2y$10$XR0OEyelD/uiohvPa.utUeUnwjfpaRJdfgKXeMon.8.4r0hW4kiES')