BACKEND/API_CI4/app/Controllers/User.php

    public function index()
    {
        $users = new UserModel;
        return $this->respond(['users' => $users->findAll()], 200);
---
SELECT *
FROM `users`